app/Models/CandidatesModel.php

SELECT `user_blog`.*
FROM `user_blog`
WHERE `user_blog`.`id` = '1'
---
    public function getBlogData($userId)
    {

        $builder = $this->db->table('user_blog');
        $builder->select('user_blog.*');

        $builder->where('user_blog.id', $userId);
        $query = $builder->get();

SELECT `user_blog`.*
FROM `user_blog`
---
    public function getAllUserData()
    {
        $builder = $this->db->table('user_blog');
        $builder->select('user_blog.*');


        $query = $builder->get();