app/Models/EventsModel.php

SELECT `user_events`.*
FROM `user_events`
---
    public function getAllUserData()
    {
        $builder = $this->db->table('user_events');
        $builder->select('user_events.*');


        $query = $builder->get();